// オープニング
const openingScenario = [
    { speaker: "ト書き", text: "眩しい。\n何も見えない。" },
    { speaker: "ト書き", text: "真っ白な視界が、少しずつ光に慣れていく。" },
    { speaker: "ト書き", text: "そこは四方を白い壁に囲われた部屋だった。\n天井についた照明が、痛いくらい部屋を照らしている。" },
    { speaker: "ハナ", text: "良かった、気がついたんだね" },
    { speaker: "ト書き", text: "天井を見上げていると、後ろから声をかけられた。\nはっとして振り向くと、1人の少女がこちらに微笑みかけていた。" },
    { speaker: "主人公", text: "君は……誰？" },
    { speaker: "ト書き", text: "反射的に問いかける。\n彼女は少し眉を顰めて黙り込んだあと、口を開いた。" },
    { speaker: "ハナ", text: "ごめんなさい。今は何も話せないんです。\nどういうことかって思うかもしれないけど……\nあなたは、自分のことはわかりますか？" },
    { speaker: "主人公", text: "自分のこと？" },
    { speaker: "ト書き", text: "自分は……名前は？\nどうやってここに？\n記憶を辿ろうとしても、ついさっき見た天井の照明以外に何も浮かんでこない。\n頭の中が真っ白になっていた。" },
    { speaker: "主人公", text: "何も……思い出せない" },
    { speaker: "ハナ", text: "何も、思い出せないよね" },
    { speaker: "ハナ", text: "わたしが記憶を取り戻すのを手伝ってあげる！" },
    { speaker: "主人公", text: "記憶を取り戻す？　どうやって？" },
    { speaker: "ハナ", text: "それは、この先の部屋に進めばわかるよ" },
    { speaker: "ト書き", text: "彼女が指を指す先には、先ほどまでは何もなかったはずの部屋の壁に、一つの扉ができていた。" },
    { speaker: "主人公", text: "いったい、どういうことなんだ？" },
    { speaker: "ト書き", text: "急な展開に、頭の整理が追いつかない。" },
    { speaker: "ハナ", text: "安心して、大丈夫だよ。\n最後まで一緒にいるからね。\nさあ、扉を開けて？" },
    { speaker: "ト書き", text: "彼女に背中を押され、僕は扉のドアノブを回した。\nガチャリ。キィー。\n扉はひとりでに開き、部屋の中に吸い込まれるようだった。\n視界が一瞬、まばゆい光に包まれた。" }
];
