//==================================
// オープニングシナリオ
//==================================

const openingScenario = [

    {
        speaker: "？？？",
        text: "……よかった。"
    },

    {
        speaker: "主人公",
        text: "ここは……？"
    },

    {
        speaker: "？？？",
        text: "気が付いた？"
    },

    {
        speaker: "主人公",
        text: "あなたは…誰ですか？"
    },

    {
        speaker: "？？？",
        text: "それは今はまだ話せないの。"
    },

    {
        speaker: "？？？",
        text: "むこうに扉が見えるでしょ？"
    }

];